constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    airfoilDown
    {
        type            wall;
        inGroups        1(wall);
        nFaces          79;
        startFace       27650;
    }
    airfoilUp
    {
        type            wall;
        inGroups        1(wall);
        nFaces          79;
        startFace       27729;
    }
    farfield
    {
        type            patch;
        nFaces          158;
        startFace       27808;
    }
    BaseAndTop
    {
        type            empty;
        inGroups        1(empty);
        nFaces          27808;
        startFace       27966;
    }
)

// ************************************************************************* //
